{
  "database": {
    "connection_string": ""
  },
  "nbp_api": {
    "base_url": "https://api.nbp.pl/api/exchangerates/tables"
  },
  "tables": [ 
    "A", 
    "B", 
    "C"
  ],
  "exchanges": [
    "mid",
    "bid",
    "ask"
  ],
  "show_dataframe": false,
  "plot_types": [
    {
      "name": "Kurs w czasie",
      "description": "Klasyczny wykres liniowy przedstawiający zmiany kursu wybranej waluty w czasie. Umożliwia obserwację trendów, sezonowości oraz lokalnych ekstremów. Wykres ten odpowiada tzw. analizie szeregów czasowych (time series analysis)."
    },
    {
      "name": "Zmiana dzienna (%)",
      "description": "Wykres słupkowy pokazujący dzienną procentową zmianę kursu w stosunku do dnia poprzedniego. Wartość ta jest obliczana jako pochodna względna: ((kurs_dziś / kurs_wczoraj) - 1) × 100%. Pozwala ocenić krótkoterminową zmienność oraz dynamikę waluty."
    },
    {
      "name": "Średnia krocząca (7 dni)",
      "description": "Wykres liniowy prezentujący 7-dniową średnią kroczącą kursu waluty. Średnia krocząca (ang. moving average) wygładza szereg czasowy, eliminując przypadkowe wahania i pozwalając lepiej dostrzec długoterminowy trend cenowy."
    },
    {
      "name": "Odchylenie (7 dni)",
      "description": "Wykres liniowy przedstawiający 7-dniowe odchylenie standardowe dziennych zmian kursu. Odchylenie standardowe jest klasyczną miarą zmienności (volatility) w analizie finansowej — im wyższe, tym bardziej niestabilny kurs waluty."
    },
    {
      "name": "Relacja walut",
      "description": "Wykres liniowy przedstawiający relację (stosunek) kursów dwóch wybranych walut. Pokazuje, ile jednostek drugiej waluty można uzyskać za jedną jednostkę pierwszej. Jest to podstawowy sposób analizy relatywnej siły walut w ekonomii międzynarodowej."
    },
    {
      "name": "Wskaźnik siły waluty",
      "description": "Wykres liniowy obrazujący względną siłę wybranej waluty względem innych, przy założeniu, że jej początkowa wartość wynosi 100. Dzięki temu można porównywać, które waluty zyskały lub straciły na wartości w tym samym okresie — jest to uproszczony indeks siły walutowej (Currency Strength Index)."
    },
    {
      "name": "Korelacja pomiędzy kursami walut",
      "description": "Mapa cieplna przedstawiająca współczynniki korelacji między kursami różnych walut. Korelacja mierzy stopień liniowej zależności pomiędzy dwiema walutami: wartość bliska +1 oznacza silny związek dodatni (waluty poruszają się podobnie), a wartość bliska -1 — związek ujemny (poruszają się przeciwnie). To narzędzie statystyczne jest szeroko stosowane w analizie portfelowej i zarządzaniu ryzykiem walutowym."
    }
  ]
}
